Ran Plan for project: `sg` dir: `examples/sg` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.ex-1 must be replaced
-/+ resource "aws_security_group" "ex-1" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-0cece9248d517b78f" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0cece9248d517b78f" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-101" -> "ex-10" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ex-2 must be replaced
-/+ resource "aws_security_group" "ex-2" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-07aa5b0e0d012a4e1" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-07aa5b0e0d012a4e1" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-102" -> "ex-11" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ex-3 must be replaced
-/+ resource "aws_security_group" "ex-3" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-022c8879846c75529" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-022c8879846c75529" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-103" -> "ex-12" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ex-4 must be replaced
-/+ resource "aws_security_group" "ex-4" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-0ce2de33b3e4d8e1b" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0ce2de33b3e4d8e1b" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-104" -> "ex-13" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sg
  ```
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sg
  ```
Plan: 4 to add, 0 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```